zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_BCTU.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for BCTU
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_BCTU.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for BCTU
 *
 * CMSIS Peripheral Access Layer for BCTU
 */

#if !defined(PERI_BCTU_H_)
#define PERI_BCTU_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(BCTU_TRIG_SOURCE_T_)
#define BCTU_TRIG_SOURCE_T_
/*!
 * @brief BCTU hardware trigger source enumeration
 */
typedef enum _bctu_trig_source
{
    kBCTU_TrigSourceEmios0Ch0       = 0U,          /**< EMIOS0 Channel0 */
    kBCTU_TrigSourceEmios0Ch1       = 1U,          /**< EMIOS0 Channel1 */
    kBCTU_TrigSourceEmios0Ch2       = 2U,          /**< EMIOS0 Channel2 */
    kBCTU_TrigSourceEmios0Ch3       = 3U,          /**< EMIOS0 Channel3 */
    kBCTU_TrigSourceEmios0Ch4       = 4U,          /**< EMIOS0 Channel4 */
    kBCTU_TrigSourceEmios0Ch5       = 5U,          /**< EMIOS0 Channel5 */
    kBCTU_TrigSourceEmios0Ch6       = 6U,          /**< EMIOS0 Channel6 */
    kBCTU_TrigSourceEmios0Ch7       = 7U,          /**< EMIOS0 Channel7 */
    kBCTU_TrigSourceEmios0Ch8       = 8U,          /**< EMIOS0 Channel8 */
    kBCTU_TrigSourceEmios0Ch9       = 9U,          /**< EMIOS0 Channel9 */
    kBCTU_TrigSourceEmios0Ch10      = 10U,         /**< EMIOS0 Channel10 */
    kBCTU_TrigSourceEmios0Ch11      = 11U,         /**< EMIOS0 Channel11 */
    kBCTU_TrigSourceEmios0Ch12      = 12U,         /**< EMIOS0 Channel12 */
    kBCTU_TrigSourceEmios0Ch13      = 13U,         /**< EMIOS0 Channel13 */
    kBCTU_TrigSourceEmios0Ch14      = 14U,         /**< EMIOS0 Channel14 */
    kBCTU_TrigSourceEmios0Ch15      = 15U,         /**< EMIOS0 Channel15 */
    kBCTU_TrigSourceEmios0Ch16      = 16U,         /**< EMIOS0 Channel16 */
    kBCTU_TrigSourceEmios0Ch17      = 17U,         /**< EMIOS0 Channel17 */
    kBCTU_TrigSourceEmios0Ch18      = 18U,         /**< EMIOS0 Channel18 */
    kBCTU_TrigSourceEmios0Ch19      = 19U,         /**< EMIOS0 Channel19 */
    kBCTU_TrigSourceEmios0Ch20      = 20U,         /**< EMIOS0 Channel20 */
    kBCTU_TrigSourceEmios0Ch21      = 21U,         /**< EMIOS0 Channel21 */
    kBCTU_TrigSourceEmios0Ch22      = 22U,         /**< EMIOS0 Channel22 */
    kBCTU_TrigSourceTrgmuxTrg1      = 23U,         /**< TRGMUX Trigger1 */
    kBCTU_TrigSourceEmios1Ch0       = 24U,         /**< EMIOS1 Channel0 */
    kBCTU_TrigSourceEmios1Ch1       = 25U,         /**< EMIOS1 Channel1 */
    kBCTU_TrigSourceEmios1Ch2       = 26U,         /**< EMIOS1 Channel2 */
    kBCTU_TrigSourceEmios1Ch3       = 27U,         /**< EMIOS1 Channel3 */
    kBCTU_TrigSourceEmios1Ch4       = 28U,         /**< EMIOS1 Channel4 */
    kBCTU_TrigSourceEmios1Ch5       = 29U,         /**< EMIOS1 Channel5 */
    kBCTU_TrigSourceEmios1Ch6       = 30U,         /**< EMIOS1 Channel6 */
    kBCTU_TrigSourceEmios1Ch7       = 31U,         /**< EMIOS1 Channel7 */
    kBCTU_TrigSourceEmios1Ch8       = 32U,         /**< EMIOS1 Channel8 */
    kBCTU_TrigSourceEmios1Ch9       = 33U,         /**< EMIOS1 Channel9 */
    kBCTU_TrigSourceEmios1Ch10      = 34U,         /**< EMIOS1 Channel10 */
    kBCTU_TrigSourceEmios1Ch11      = 35U,         /**< EMIOS1 Channel11 */
    kBCTU_TrigSourceEmios1Ch12      = 36U,         /**< EMIOS1 Channel12 */
    kBCTU_TrigSourceEmios1Ch13      = 37U,         /**< EMIOS1 Channel13 */
    kBCTU_TrigSourceEmios1Ch14      = 38U,         /**< EMIOS1 Channel14 */
    kBCTU_TrigSourceEmios1Ch15      = 39U,         /**< EMIOS1 Channel15 */
    kBCTU_TrigSourceEmios1Ch16      = 40U,         /**< EMIOS1 Channel16 */
    kBCTU_TrigSourceEmios1Ch17      = 41U,         /**< EMIOS1 Channel17 */
    kBCTU_TrigSourceEmios1Ch18      = 42U,         /**< EMIOS1 Channel18 */
    kBCTU_TrigSourceEmios1Ch19      = 43U,         /**< EMIOS1 Channel19 */
    kBCTU_TrigSourceEmios1Ch20      = 44U,         /**< EMIOS1 Channel20 */
    kBCTU_TrigSourceEmios1Ch21      = 45U,         /**< EMIOS1 Channel21 */
    kBCTU_TrigSourceEmios1Ch22      = 46U,         /**< EMIOS1 Channel22 */
    kBCTU_TrigSourceTrgmuxTrg2      = 47U,         /**< TRGMUX Trigger2 */
    kBCTU_TrigSourceEmios2Ch0       = 48U,         /**< EMIOS2 Channel0 */
    kBCTU_TrigSourceEmios2Ch1       = 49U,         /**< EMIOS2 Channel1 */
    kBCTU_TrigSourceEmios2Ch2       = 50U,         /**< EMIOS2 Channel2 */
    kBCTU_TrigSourceEmios2Ch3       = 51U,         /**< EMIOS2 Channel3 */
    kBCTU_TrigSourceEmios2Ch4       = 52U,         /**< EMIOS2 Channel4 */
    kBCTU_TrigSourceEmios2Ch5       = 53U,         /**< EMIOS2 Channel5 */
    kBCTU_TrigSourceEmios2Ch6       = 54U,         /**< EMIOS2 Channel6 */
    kBCTU_TrigSourceEmios2Ch7       = 55U,         /**< EMIOS2 Channel7 */
    kBCTU_TrigSourceEmios2Ch8       = 56U,         /**< EMIOS2 Channel8 */
    kBCTU_TrigSourceEmios2Ch9       = 57U,         /**< EMIOS2 Channel9 */
    kBCTU_TrigSourceEmios2Ch10      = 58U,         /**< EMIOS2 Channel10 */
    kBCTU_TrigSourceEmios2Ch11      = 59U,         /**< EMIOS2 Channel11 */
    kBCTU_TrigSourceEmios2Ch12      = 60U,         /**< EMIOS2 Channel12 */
    kBCTU_TrigSourceEmios2Ch13      = 61U,         /**< EMIOS2 Channel13 */
    kBCTU_TrigSourceEmios2Ch14      = 62U,         /**< EMIOS2 Channel14 */
    kBCTU_TrigSourceEmios2Ch15      = 63U,         /**< EMIOS2 Channel15 */
    kBCTU_TrigSourceEmios2Ch16      = 64U,         /**< EMIOS2 Channel16 */
    kBCTU_TrigSourceEmios2Ch17      = 65U,         /**< EMIOS2 Channel17 */
    kBCTU_TrigSourceEmios2Ch18      = 66U,         /**< EMIOS2 Channel18 */
    kBCTU_TrigSourceEmios2Ch19      = 67U,         /**< EMIOS2 Channel19 */
    kBCTU_TrigSourceEmios2Ch20      = 68U,         /**< EMIOS2 Channel20 */
    kBCTU_TrigSourceEmios2Ch21      = 69U,         /**< EMIOS2 Channel21 */
    kBCTU_TrigSourceEmios2Ch22      = 70U,         /**< EMIOS2 Channel22 */
    kBCTU_TrigSourceTrgmuxTrg3      = 71U,         /**< TRGMUX Trigger3 */
} bctu_trig_source_t;
#endif /* BCTU_TRIG_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


