zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_BCTU.h
#define BCTU_MCR_MDIS_MASK                       (0x40000000U)
#define BCTU_MCR_MDIS_SHIFT                      (30U)
/*! MDIS - Module Disable
 *  0b0..Enable (normal operation)
 *  0b1..Disable (low-power operation)
 */
#define BCTU_MCR_MDIS(x)                         (((uint32_t)(((uint32_t)(x)) << BCTU_MCR_MDIS_SHIFT)) & BCTU_MCR_MDIS_MASK)

#define BCTU_MCR_Software_Reset_MASK             (0x80000000U)
#define BCTU_MCR_Software_Reset_SHIFT            (31U)
/*! Software_Reset - Software Reset
 *  0b0..Deasserts
 *  0b1..Asserts
 */
#define BCTU_MCR_Software_Reset(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MCR_Software_Reset_SHIFT)) & BCTU_MCR_Software_Reset_MASK)
/*! @} */

/*! @name MSR - Module Status */
/*! @{ */

#define BCTU_MSR_NDATA0_MASK                     (0x1U)
#define BCTU_MSR_NDATA0_SHIFT                    (0U)
/*! NDATA0 - New Data 0
 *  0b0..Not available
 *  0b1..Available
 */
#define BCTU_MSR_NDATA0(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA0_SHIFT)) & BCTU_MSR_NDATA0_MASK)

#define BCTU_MSR_NDATA1_MASK                     (0x2U)
#define BCTU_MSR_NDATA1_SHIFT                    (1U)
/*! NDATA1 - New Data 1
 *  0b0..Not available
 *  0b1..Available
 */
#define BCTU_MSR_NDATA1(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA1_SHIFT)) & BCTU_MSR_NDATA1_MASK)

#define BCTU_MSR_NDATA2_MASK                     (0x4U)
#define BCTU_MSR_NDATA2_SHIFT                    (2U)
/*! NDATA2 - New Data 2
 *  0b0..Not available
 *  0b1..Available
 */
#define BCTU_MSR_NDATA2(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA2_SHIFT)) & BCTU_MSR_NDATA2_MASK)

#define BCTU_MSR_DATAOVR0_MASK                   (0x10U)
#define BCTU_MSR_DATAOVR0_SHIFT                  (4U)
/*! DATAOVR0 - Data Overrun 0
 *  0b0..Data not overwritten
 *  0b1..Data overwritten
 */
#define BCTU_MSR_DATAOVR0(x)                     (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR0_SHIFT)) & BCTU_MSR_DATAOVR0_MASK)

#define BCTU_MSR_DATAOVR1_MASK                   (0x20U)
#define BCTU_MSR_DATAOVR1_SHIFT                  (5U)
/*! DATAOVR1 - Data Overrun 1
 *  0b0..Data not overwritten
 *  0b1..Data overwritten
 */
#define BCTU_MSR_DATAOVR1(x)                     (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR1_SHIFT)) & BCTU_MSR_DATAOVR1_MASK)

#define BCTU_MSR_DATAOVR2_MASK                   (0x40U)
#define BCTU_MSR_DATAOVR2_SHIFT                  (6U)
/*! DATAOVR2 - Data Overrun 2
 *  0b0..Data not overwritten
 *  0b1..Data overwritten
 */
#define BCTU_MSR_DATAOVR2(x)                     (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR2_SHIFT)) & BCTU_MSR_DATAOVR2_MASK)

#define BCTU_MSR_LIST0_Last_MASK                 (0x100U)
#define BCTU_MSR_LIST0_Last_SHIFT                (8U)
/*! LIST0_Last - CL 0 Last Conversion
 *  0b0..Last conversion not complete
 *  0b1..Last conversion complete
 */
#define BCTU_MSR_LIST0_Last(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST0_Last_SHIFT)) & BCTU_MSR_LIST0_Last_MASK)

#define BCTU_MSR_LIST1_Last_MASK                 (0x200U)
#define BCTU_MSR_LIST1_Last_SHIFT                (9U)
/*! LIST1_Last - CL 1 Last Conversion
 *  0b0..Last conversion not complete
 *  0b1..Last conversion complete
 */
#define BCTU_MSR_LIST1_Last(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST1_Last_SHIFT)) & BCTU_MSR_LIST1_Last_MASK)

#define BCTU_MSR_LIST2_Last_MASK                 (0x400U)
#define BCTU_MSR_LIST2_Last_SHIFT                (10U)
/*! LIST2_Last - CL 2 Last Conversion
 *  0b0..Last conversion not complete
 *  0b1..Last conversion complete
 */
#define BCTU_MSR_LIST2_Last(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST2_Last_SHIFT)) & BCTU_MSR_LIST2_Last_MASK)

#define BCTU_MSR_TRGF_MASK                       (0x8000U)
#define BCTU_MSR_TRGF_SHIFT                      (15U)
/*! TRGF - Trigger Flag
 *  0b0..No ADC triggered
 *  0b1..An ADC was triggered
 */
#define BCTU_MSR_TRGF(x)                         (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_TRGF_SHIFT)) & BCTU_MSR_TRGF_MASK)

#define BCTU_MSR_NDATA0_CLR_MASK                 (0x10000U)
#define BCTU_MSR_NDATA0_CLR_SHIFT                (16U)
/*! NDATA0_CLR - New Data Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_NDATA0_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA0_CLR_SHIFT)) & BCTU_MSR_NDATA0_CLR_MASK)

#define BCTU_MSR_NDATA1_CLR_MASK                 (0x20000U)
#define BCTU_MSR_NDATA1_CLR_SHIFT                (17U)
/*! NDATA1_CLR - New Data Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_NDATA1_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA1_CLR_SHIFT)) & BCTU_MSR_NDATA1_CLR_MASK)

#define BCTU_MSR_NDATA2_CLR_MASK                 (0x40000U)
#define BCTU_MSR_NDATA2_CLR_SHIFT                (18U)
/*! NDATA2_CLR - New Data Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_NDATA2_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA2_CLR_SHIFT)) & BCTU_MSR_NDATA2_CLR_MASK)

#define BCTU_MSR_DATAOVR0_CLR_MASK               (0x100000U)
#define BCTU_MSR_DATAOVR0_CLR_SHIFT              (20U)
/*! DATAOVR0_CLR - DATAOVR0 Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_DATAOVR0_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR0_CLR_SHIFT)) & BCTU_MSR_DATAOVR0_CLR_MASK)

#define BCTU_MSR_DATAOVR1_CLR_MASK               (0x200000U)
#define BCTU_MSR_DATAOVR1_CLR_SHIFT              (21U)
/*! DATAOVR1_CLR - DATAOVR1 Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_DATAOVR1_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR1_CLR_SHIFT)) & BCTU_MSR_DATAOVR1_CLR_MASK)

#define BCTU_MSR_DATAOVR2_CLR_MASK               (0x400000U)
#define BCTU_MSR_DATAOVR2_CLR_SHIFT              (22U)
/*! DATAOVR2_CLR - DATAOVR2 Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_DATAOVR2_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR2_CLR_SHIFT)) & BCTU_MSR_DATAOVR2_CLR_MASK)

#define BCTU_MSR_LIST0_Last_CLR_MASK             (0x1000000U)
#define BCTU_MSR_LIST0_Last_CLR_SHIFT            (24U)
/*! LIST0_Last_CLR - CL 0 Last Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_LIST0_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST0_Last_CLR_SHIFT)) & BCTU_MSR_LIST0_Last_CLR_MASK)

#define BCTU_MSR_LIST1_Last_CLR_MASK             (0x2000000U)
#define BCTU_MSR_LIST1_Last_CLR_SHIFT            (25U)
/*! LIST1_Last_CLR - CL 1 Last Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_LIST1_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST1_Last_CLR_SHIFT)) & BCTU_MSR_LIST1_Last_CLR_MASK)

#define BCTU_MSR_LIST2_Last_CLR_MASK             (0x4000000U)
#define BCTU_MSR_LIST2_Last_CLR_SHIFT            (26U)
/*! LIST2_Last_CLR - CL 2 Last Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_LIST2_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST2_Last_CLR_SHIFT)) & BCTU_MSR_LIST2_Last_CLR_MASK)

#define BCTU_MSR_TRGF_CLR_MASK                   (0x80000000U)
#define BCTU_MSR_TRGF_CLR_SHIFT                  (31U)
/*! TRGF_CLR - TRGF Clear
 *  0b0..No action
 *  0b1..Changes to 0
 */
#define BCTU_MSR_TRGF_CLR(x)                     (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_TRGF_CLR_SHIFT)) & BCTU_MSR_TRGF_CLR_MASK)
/*! @} */

/*! @name TRGCFG - Trigger Configuration */
/*! @{ */

#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_MASK  (0x7FU)
#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_SHIFT (0U)
/*! CHANNEL_VALUE_OR_LADDR - Channel or CL Address */
#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR(x)    (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_SHIFT)) & BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_MASK)

#define BCTU_TRGCFG_ADC_SEL0_MASK                (0x100U)
#define BCTU_TRGCFG_ADC_SEL0_SHIFT               (8U)
/*! ADC_SEL0 - ADC Select 0
 *  0b0..Deselects
 *  0b1..Selects
 */
#define BCTU_TRGCFG_ADC_SEL0(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL0_SHIFT)) & BCTU_TRGCFG_ADC_SEL0_MASK)

#define BCTU_TRGCFG_ADC_SEL1_MASK                (0x200U)
#define BCTU_TRGCFG_ADC_SEL1_SHIFT               (9U)
/*! ADC_SEL1 - ADC Select 1
 *  0b0..Deselects
 *  0b1..Selects
 */
#define BCTU_TRGCFG_ADC_SEL1(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL1_SHIFT)) & BCTU_TRGCFG_ADC_SEL1_MASK)

#define BCTU_TRGCFG_ADC_SEL2_MASK                (0x400U)
#define BCTU_TRGCFG_ADC_SEL2_SHIFT               (10U)
/*! ADC_SEL2 - ADC Select 2
 *  0b0..Deselects
 *  0b1..Selects
 */
#define BCTU_TRGCFG_ADC_SEL2(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL2_SHIFT)) & BCTU_TRGCFG_ADC_SEL2_MASK)

