zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_BCTU.h
#define BCTU_SFTRGR2_SFTRG36_MASK                (0x10U)
#define BCTU_SFTRGR2_SFTRG36_SHIFT               (4U)
/*! SFTRG36 - Software Trigger 36
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG36(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG36_SHIFT)) & BCTU_SFTRGR2_SFTRG36_MASK)

#define BCTU_SFTRGR2_SFTRG37_MASK                (0x20U)
#define BCTU_SFTRGR2_SFTRG37_SHIFT               (5U)
/*! SFTRG37 - Software Trigger 37
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG37(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG37_SHIFT)) & BCTU_SFTRGR2_SFTRG37_MASK)

#define BCTU_SFTRGR2_SFTRG38_MASK                (0x40U)
#define BCTU_SFTRGR2_SFTRG38_SHIFT               (6U)
/*! SFTRG38 - Software Trigger 38
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG38(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG38_SHIFT)) & BCTU_SFTRGR2_SFTRG38_MASK)

#define BCTU_SFTRGR2_SFTRG39_MASK                (0x80U)
#define BCTU_SFTRGR2_SFTRG39_SHIFT               (7U)
/*! SFTRG39 - Software Trigger 39
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG39(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG39_SHIFT)) & BCTU_SFTRGR2_SFTRG39_MASK)

#define BCTU_SFTRGR2_SFTRG40_MASK                (0x100U)
#define BCTU_SFTRGR2_SFTRG40_SHIFT               (8U)
/*! SFTRG40 - Software Trigger 40
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG40(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG40_SHIFT)) & BCTU_SFTRGR2_SFTRG40_MASK)

#define BCTU_SFTRGR2_SFTRG41_MASK                (0x200U)
#define BCTU_SFTRGR2_SFTRG41_SHIFT               (9U)
/*! SFTRG41 - Software Trigger 41
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG41(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG41_SHIFT)) & BCTU_SFTRGR2_SFTRG41_MASK)

#define BCTU_SFTRGR2_SFTRG42_MASK                (0x400U)
#define BCTU_SFTRGR2_SFTRG42_SHIFT               (10U)
/*! SFTRG42 - Software Trigger 42
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG42(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG42_SHIFT)) & BCTU_SFTRGR2_SFTRG42_MASK)

#define BCTU_SFTRGR2_SFTRG43_MASK                (0x800U)
#define BCTU_SFTRGR2_SFTRG43_SHIFT               (11U)
/*! SFTRG43 - Software Trigger 43
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG43(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG43_SHIFT)) & BCTU_SFTRGR2_SFTRG43_MASK)

#define BCTU_SFTRGR2_SFTRG44_MASK                (0x1000U)
#define BCTU_SFTRGR2_SFTRG44_SHIFT               (12U)
/*! SFTRG44 - Software Trigger 44
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG44(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG44_SHIFT)) & BCTU_SFTRGR2_SFTRG44_MASK)

#define BCTU_SFTRGR2_SFTRG45_MASK                (0x2000U)
#define BCTU_SFTRGR2_SFTRG45_SHIFT               (13U)
/*! SFTRG45 - Software Trigger 45
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG45(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG45_SHIFT)) & BCTU_SFTRGR2_SFTRG45_MASK)

#define BCTU_SFTRGR2_SFTRG46_MASK                (0x4000U)
#define BCTU_SFTRGR2_SFTRG46_SHIFT               (14U)
/*! SFTRG46 - Software Trigger 46
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG46(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG46_SHIFT)) & BCTU_SFTRGR2_SFTRG46_MASK)

#define BCTU_SFTRGR2_SFTRG47_MASK                (0x8000U)
#define BCTU_SFTRGR2_SFTRG47_SHIFT               (15U)
/*! SFTRG47 - Software Trigger 47
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG47(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG47_SHIFT)) & BCTU_SFTRGR2_SFTRG47_MASK)

#define BCTU_SFTRGR2_SFTRG48_MASK                (0x10000U)
#define BCTU_SFTRGR2_SFTRG48_SHIFT               (16U)
/*! SFTRG48 - Software Trigger 48
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG48(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG48_SHIFT)) & BCTU_SFTRGR2_SFTRG48_MASK)

#define BCTU_SFTRGR2_SFTRG49_MASK                (0x20000U)
#define BCTU_SFTRGR2_SFTRG49_SHIFT               (17U)
/*! SFTRG49 - Software Trigger 49
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG49(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG49_SHIFT)) & BCTU_SFTRGR2_SFTRG49_MASK)

#define BCTU_SFTRGR2_SFTRG50_MASK                (0x40000U)
#define BCTU_SFTRGR2_SFTRG50_SHIFT               (18U)
/*! SFTRG50 - Software Trigger 50
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG50(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG50_SHIFT)) & BCTU_SFTRGR2_SFTRG50_MASK)

#define BCTU_SFTRGR2_SFTRG51_MASK                (0x80000U)
#define BCTU_SFTRGR2_SFTRG51_SHIFT               (19U)
/*! SFTRG51 - Software Trigger 51
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG51(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG51_SHIFT)) & BCTU_SFTRGR2_SFTRG51_MASK)

#define BCTU_SFTRGR2_SFTRG52_MASK                (0x100000U)
#define BCTU_SFTRGR2_SFTRG52_SHIFT               (20U)
/*! SFTRG52 - Software Trigger 52
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG52(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG52_SHIFT)) & BCTU_SFTRGR2_SFTRG52_MASK)

#define BCTU_SFTRGR2_SFTRG53_MASK                (0x200000U)
#define BCTU_SFTRGR2_SFTRG53_SHIFT               (21U)
/*! SFTRG53 - Software Trigger 53
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG53(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG53_SHIFT)) & BCTU_SFTRGR2_SFTRG53_MASK)

#define BCTU_SFTRGR2_SFTRG54_MASK                (0x400000U)
#define BCTU_SFTRGR2_SFTRG54_SHIFT               (22U)
/*! SFTRG54 - Software Trigger 54
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG54(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG54_SHIFT)) & BCTU_SFTRGR2_SFTRG54_MASK)

#define BCTU_SFTRGR2_SFTRG55_MASK                (0x800000U)
#define BCTU_SFTRGR2_SFTRG55_SHIFT               (23U)
/*! SFTRG55 - Software Trigger 55
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG55(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG55_SHIFT)) & BCTU_SFTRGR2_SFTRG55_MASK)

#define BCTU_SFTRGR2_SFTRG56_MASK                (0x1000000U)
#define BCTU_SFTRGR2_SFTRG56_SHIFT               (24U)
/*! SFTRG56 - Software Trigger 56
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG56(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG56_SHIFT)) & BCTU_SFTRGR2_SFTRG56_MASK)

#define BCTU_SFTRGR2_SFTRG57_MASK                (0x2000000U)
#define BCTU_SFTRGR2_SFTRG57_SHIFT               (25U)
/*! SFTRG57 - Software Trigger 57
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG57(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG57_SHIFT)) & BCTU_SFTRGR2_SFTRG57_MASK)

