zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_BCTU.h
#define BCTU_SFTRGR2_SFTRG58_MASK                (0x4000000U)
#define BCTU_SFTRGR2_SFTRG58_SHIFT               (26U)
/*! SFTRG58 - Software Trigger 58
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG58(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG58_SHIFT)) & BCTU_SFTRGR2_SFTRG58_MASK)

#define BCTU_SFTRGR2_SFTRG59_MASK                (0x8000000U)
#define BCTU_SFTRGR2_SFTRG59_SHIFT               (27U)
/*! SFTRG59 - Software Trigger 59
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG59(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG59_SHIFT)) & BCTU_SFTRGR2_SFTRG59_MASK)

#define BCTU_SFTRGR2_SFTRG60_MASK                (0x10000000U)
#define BCTU_SFTRGR2_SFTRG60_SHIFT               (28U)
/*! SFTRG60 - Software Trigger 60
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG60(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG60_SHIFT)) & BCTU_SFTRGR2_SFTRG60_MASK)

#define BCTU_SFTRGR2_SFTRG61_MASK                (0x20000000U)
#define BCTU_SFTRGR2_SFTRG61_SHIFT               (29U)
/*! SFTRG61 - Software Trigger 61
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG61(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG61_SHIFT)) & BCTU_SFTRGR2_SFTRG61_MASK)

#define BCTU_SFTRGR2_SFTRG62_MASK                (0x40000000U)
#define BCTU_SFTRGR2_SFTRG62_SHIFT               (30U)
/*! SFTRG62 - Software Trigger 62
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG62(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG62_SHIFT)) & BCTU_SFTRGR2_SFTRG62_MASK)

#define BCTU_SFTRGR2_SFTRG63_MASK                (0x80000000U)
#define BCTU_SFTRGR2_SFTRG63_SHIFT               (31U)
/*! SFTRG63 - Software Trigger 63
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR2_SFTRG63(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG63_SHIFT)) & BCTU_SFTRGR2_SFTRG63_MASK)
/*! @} */

/*! @name SFTRGR3 - Software Trigger 3 */
/*! @{ */

#define BCTU_SFTRGR3_SFTRG64_MASK                (0x1U)
#define BCTU_SFTRGR3_SFTRG64_SHIFT               (0U)
/*! SFTRG64 - Software Trigger 64
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG64(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG64_SHIFT)) & BCTU_SFTRGR3_SFTRG64_MASK)

#define BCTU_SFTRGR3_SFTRG65_MASK                (0x2U)
#define BCTU_SFTRGR3_SFTRG65_SHIFT               (1U)
/*! SFTRG65 - Software Trigger 65
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG65(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG65_SHIFT)) & BCTU_SFTRGR3_SFTRG65_MASK)

#define BCTU_SFTRGR3_SFTRG66_MASK                (0x4U)
#define BCTU_SFTRGR3_SFTRG66_SHIFT               (2U)
/*! SFTRG66 - Software Trigger 66
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG66(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG66_SHIFT)) & BCTU_SFTRGR3_SFTRG66_MASK)

#define BCTU_SFTRGR3_SFTRG67_MASK                (0x8U)
#define BCTU_SFTRGR3_SFTRG67_SHIFT               (3U)
/*! SFTRG67 - Software Trigger 67
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG67(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG67_SHIFT)) & BCTU_SFTRGR3_SFTRG67_MASK)

#define BCTU_SFTRGR3_SFTRG68_MASK                (0x10U)
#define BCTU_SFTRGR3_SFTRG68_SHIFT               (4U)
/*! SFTRG68 - Software Trigger 68
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG68(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG68_SHIFT)) & BCTU_SFTRGR3_SFTRG68_MASK)

#define BCTU_SFTRGR3_SFTRG69_MASK                (0x20U)
#define BCTU_SFTRGR3_SFTRG69_SHIFT               (5U)
/*! SFTRG69 - Software Trigger 69
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG69(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG69_SHIFT)) & BCTU_SFTRGR3_SFTRG69_MASK)

#define BCTU_SFTRGR3_SFTRG70_MASK                (0x40U)
#define BCTU_SFTRGR3_SFTRG70_SHIFT               (6U)
/*! SFTRG70 - Software Trigger 70
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG70(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG70_SHIFT)) & BCTU_SFTRGR3_SFTRG70_MASK)

#define BCTU_SFTRGR3_SFTRG71_MASK                (0x80U)
#define BCTU_SFTRGR3_SFTRG71_SHIFT               (7U)
/*! SFTRG71 - Software Trigger 71
 *  0b0..No effect
 *  0b1..Trigger conversion
 */
#define BCTU_SFTRGR3_SFTRG71(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG71_SHIFT)) & BCTU_SFTRGR3_SFTRG71_MASK)
/*! @} */

/*! @name ADCDR - ADC0 Result Data..ADC2 Result Data */
/*! @{ */

#define BCTU_ADCDR_ADC_DATA_MASK                 (0x7FFFU)
#define BCTU_ADCDR_ADC_DATA_SHIFT                (0U)
/*! ADC_DATA - ADC Data */
#define BCTU_ADCDR_ADC_DATA(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_ADCDR_ADC_DATA_SHIFT)) & BCTU_ADCDR_ADC_DATA_MASK)

#define BCTU_ADCDR_LAST_MASK                     (0x10000U)
#define BCTU_ADCDR_LAST_SHIFT                    (16U)
/*! LAST - Last
 *  0b0..Not the last conversion of a CL, or not a CL conversion
 *  0b1..Last conversion of a CL
 */
#define BCTU_ADCDR_LAST(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_ADCDR_LAST_SHIFT)) & BCTU_ADCDR_LAST_MASK)

#define BCTU_ADCDR_LIST_MASK                     (0x20000U)
#define BCTU_ADCDR_LIST_SHIFT                    (17U)
/*! LIST - List
 *  0b0..Single conversion
 *  0b1..CL
 */
#define BCTU_ADCDR_LIST(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_ADCDR_LIST_SHIFT)) & BCTU_ADCDR_LIST_MASK)

#define BCTU_ADCDR_CH_MASK                       (0x1FC0000U)
#define BCTU_ADCDR_CH_SHIFT                      (18U)
/*! CH - Channel */
#define BCTU_ADCDR_CH(x)                         (((uint32_t)(((uint32_t)(x)) << BCTU_ADCDR_CH_SHIFT)) & BCTU_ADCDR_CH_MASK)

#define BCTU_ADCDR_TRG_SRC_MASK                  (0xFE000000U)
#define BCTU_ADCDR_TRG_SRC_SHIFT                 (25U)
/*! TRG_SRC - Trigger Source */
#define BCTU_ADCDR_TRG_SRC(x)                    (((uint32_t)(((uint32_t)(x)) << BCTU_ADCDR_TRG_SRC_SHIFT)) & BCTU_ADCDR_TRG_SRC_MASK)
/*! @} */

/*! @name LISTSTAR - CL Size Status */
/*! @{ */

#define BCTU_LISTSTAR_LISTSZ_MASK                (0xFFU)
#define BCTU_LISTSTAR_LISTSZ_SHIFT               (0U)
/*! LISTSZ - CL Size */
#define BCTU_LISTSTAR_LISTSZ(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_LISTSTAR_LISTSZ_SHIFT)) & BCTU_LISTSTAR_LISTSZ_MASK)
/*! @} */

/*! @name LISTCHR - CL Channel Address */
/*! @{ */

